using Tyuiu.ShakhovDK.Sprint2.Task7.V6.Lib;
DataService ds = new DataService();
double x, y;
bool res;
Console.Title = "Спринт #2 | Выполнил: Шахов Д.К | ИИПБ-24-2";
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* Спринт #2                                                                              *");
Console.WriteLine("* Тема: Получение результата из switch                                                   *");
Console.WriteLine("* Задание #7                                                                             *");
Console.WriteLine("* Вариант #6                                                                            *");
Console.WriteLine("* Выполнил: Шахов Даниил Константинович | ИИПБ-24-2                                      *");
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* УСЛОВИЕ:                                                                               *");
Console.WriteLine("* Написать программу на C#, " +
    "которая запрашивает исходные данные (вещественные значения) и вычисляет, " +
    "находится ли точка с координатами X,Y в заштрихованной области.*");
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                       *");
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* Введите X:                                                                             *");
x = Convert.ToDouble(Console.ReadLine());
Console.WriteLine("* Введите Y:                                                                             *");
y = Convert.ToDouble(Console.ReadLine());
res = ds.CheckDotInShadedArea(x, y);
Console.WriteLine("******************************************************************************************");
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* РЕЗУЛЬТАТ:                                                                             *");
if (res)
{
    Console.WriteLine("Указанная точка находится в заштрихованной области");
}
else
{
    Console.WriteLine("Указанная точка не находится в заштрихованной области");
}    
Console.WriteLine("******************************************************************************************");
Console.ReadKey();