using Tyuiu.ShakhovDK.Sprint2.Task4.V26.Lib;

DataService ds = new DataService();
double x, y, res;

Console.Title = "Спринт #2 | Выполнил: Шахов Д.К | ИИПБ-24-2";
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* Спринт #2                                                                              *");
Console.WriteLine("* Тема: Тернарный оператор                                                               *");
Console.WriteLine("* Задание #4                                                                             *");
Console.WriteLine("* Вариант #26                                                                            *");
Console.WriteLine("* Выполнил: Шахов Даниил Константинович | ИИПБ-24-2                                      *");
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* УСЛОВИЕ:                                                                               *");
Console.WriteLine("* Написать программу, \n" +
    "которая вычисляет требуемое значение с использованием тернарного оператора, \n" +
    "где пользователь вводит значение переменных х,у с клавиатуры, \n" +
    "если х - 2 < у + 2, то z = 10 + z = (10 + 2 / x^2)^y иначе х^2 - (1 / y)                 *");
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                       *");
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* Введите значение переменной x:                                                         *");
x = Convert.ToDouble(Console.ReadLine());
Console.WriteLine("* Введите значение переменной y:                                                         *");
y = Convert.ToDouble(Console.ReadLine());
res = ds.Calculate(x, y);
Console.WriteLine("******************************************************************************************");
Console.WriteLine("******************************************************************************************");
Console.WriteLine("* РЕЗУЛЬТАТ:                                                                             *");
Console.WriteLine($"Значение функции = {res}");
Console.WriteLine("******************************************************************************************");
Console.ReadKey();